* All tables
:PROPERTIES:
:ID:       1833555d-5364-4fe1-aab7-d088644b0e87
:END:
#+begin_src  sql :engine postgres :dbhost micropop046 :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
SELECT table_name FROM information_schema.tables where table_schema='public'
ORDER BY table_name;
#+end_src

#+RESULTS:
| table_name                                       |
|--------------------------------------------------|
| _current_admin_privileges                        |
| _fs_deletelog                                    |
| _lock_ids                                        |
| _reindexing_required                             |
| _roles                                           |
| acquisitionmode                                  |
| adminprivilege                                   |
| affinetransform                                  |
| annotation                                       |
| annotation_mapvalue                              |
| annotationannotationlink                         |
| arc                                              |
| arctype                                          |
| binning                                          |
| channel                                          |
| channelannotationlink                            |
| channelbinding                                   |
| checksumalgorithm                                |
| codomainmapcontext                               |
| configuration                                    |
| contrastmethod                                   |
| contraststretchingcontext                        |
| correction                                       |
| count_annotation_annotationlinks_by_owner        |
| count_channel_annotationlinks_by_owner           |
| count_dataset_annotationlinks_by_owner           |
| count_dataset_imagelinks_by_owner                |
| count_dataset_projectlinks_by_owner              |
| count_detector_annotationlinks_by_owner          |
| count_dichroic_annotationlinks_by_owner          |
| count_experimenter_annotationlinks_by_owner      |
| count_experimentergroup_annotationlinks_by_owner |
| count_fileset_annotationlinks_by_owner           |
| count_fileset_joblinks_by_owner                  |
| count_filter_annotationlinks_by_owner            |
| count_filter_emissionfilterlink_by_owner         |
| count_filter_excitationfilterlink_by_owner       |
| count_filterset_emissionfilterlink_by_owner      |
| count_filterset_excitationfilterlink_by_owner    |
| count_folder_annotationlinks_by_owner            |
| count_folder_imagelinks_by_owner                 |
| count_folder_roilinks_by_owner                   |
| count_image_annotationlinks_by_owner             |
| count_image_datasetlinks_by_owner                |
| count_image_folderlinks_by_owner                 |
| count_instrument_annotationlinks_by_owner        |
| count_job_originalfilelinks_by_owner             |
| count_lightpath_annotationlinks_by_owner         |
| count_lightpath_emissionfilterlink_by_owner      |
| count_lightpath_excitationfilterlink_by_owner    |
| count_lightsource_annotationlinks_by_owner       |
| count_namespace_annotationlinks_by_owner         |
| count_node_annotationlinks_by_owner              |
| count_objective_annotationlinks_by_owner         |
| count_originalfile_annotationlinks_by_owner      |
| count_originalfile_pixelsfilemaps_by_owner       |
| count_pixels_pixelsfilemaps_by_owner             |
| count_planeinfo_annotationlinks_by_owner         |
| count_plate_annotationlinks_by_owner             |
| count_plate_screenlinks_by_owner                 |
| count_plateacquisition_annotationlinks_by_owner  |
| count_project_annotationlinks_by_owner           |
| count_project_datasetlinks_by_owner              |
| count_reagent_annotationlinks_by_owner           |
| count_reagent_welllinks_by_owner                 |
| count_roi_annotationlinks_by_owner               |
| count_roi_folderlinks_by_owner                   |
| count_screen_annotationlinks_by_owner            |
| count_screen_platelinks_by_owner                 |
| count_session_annotationlinks_by_owner           |
| count_shape_annotationlinks_by_owner             |
| count_well_annotationlinks_by_owner              |
| count_well_reagentlinks_by_owner                 |
| dataset                                          |
| datasetannotationlink                            |
| datasetimagelink                                 |
| dbpatch                                          |
| detector                                         |
| detectorannotationlink                           |
| detectorsettings                                 |
| detectortype                                     |
| dichroic                                         |
| dichroicannotationlink                           |
| dimensionorder                                   |
| event                                            |
| eventlog                                         |
| eventtype                                        |
| experiment                                       |
| experimenter                                     |
| experimenter_config                              |
| experimenterannotationlink                       |
| experimentergroup                                |
| experimentergroup_config                         |
| experimentergroupannotationlink                  |
| experimenttype                                   |
| externalinfo                                     |
| family                                           |
| filament                                         |
| filamenttype                                     |
| fileset                                          |
| filesetannotationlink                            |
| filesetentry                                     |
| filesetjoblink                                   |
| filter                                           |
| filterannotationlink                             |
| filterset                                        |
| filtersetemissionfilterlink                      |
| filtersetexcitationfilterlink                    |
| filtertype                                       |
| folder                                           |
| folderannotationlink                             |
| folderimagelink                                  |
| folderroilink                                    |
| format                                           |
| genericexcitationsource                          |
| genericexcitationsource_map                      |
| groupexperimentermap                             |
| illumination                                     |
| image                                            |
| imageannotationlink                              |
| imagingenvironment                               |
| imagingenvironment_map                           |
| immersion                                        |
| importjob                                        |
| indexingjob                                      |
| instrument                                       |
| instrumentannotationlink                         |
| integritycheckjob                                |
| job                                              |
| joboriginalfilelink                              |
| jobstatus                                        |
| laser                                            |
| lasermedium                                      |
| lasertype                                        |
| lightemittingdiode                               |
| lightpath                                        |
| lightpathannotationlink                          |
| lightpathemissionfilterlink                      |
| lightpathexcitationfilterlink                    |
| lightsettings                                    |
| lightsource                                      |
| lightsourceannotationlink                        |
| link                                             |
| logicalchannel                                   |
| medium                                           |
| metadataimportjob                                |
| metadataimportjob_versioninfo                    |
| microbeammanipulation                            |
| microbeammanipulationtype                        |
| microscope                                       |
| microscopetype                                   |
| namespace                                        |
| namespaceannotationlink                          |
| node                                             |
| nodeannotationlink                               |
| objective                                        |
| objectiveannotationlink                          |
| objectivesettings                                |
| originalfile                                     |
| originalfileannotationlink                       |
| otf                                              |
| parsejob                                         |
| password                                         |
| photometricinterpretation                        |
| pixeldatajob                                     |
| pixels                                           |
| pixelsoriginalfilemap                            |
| pixelstype                                       |
| planeinfo                                        |
| planeinfoannotationlink                          |
| planeslicingcontext                              |
| plate                                            |
| plateacquisition                                 |
| plateacquisitionannotationlink                   |
| plateannotationlink                              |
| project                                          |
| projectannotationlink                            |
| projectdatasetlink                               |
| projectionaxis                                   |
| projectiondef                                    |
| projectiontype                                   |
| pulse                                            |
| quantumdef                                       |
| reagent                                          |
| reagentannotationlink                            |
| renderingdef                                     |
| renderingmodel                                   |
| reverseintensitycontext                          |
| roi                                              |
| roiannotationlink                                |
| screen                                           |
| screenannotationlink                             |
| screenplatelink                                  |
| scriptjob                                        |
| session                                          |
| sessionannotationlink                            |
| shape                                            |
| shapeannotationlink                              |
| share                                            |
| sharemember                                      |
| stagelabel                                       |
| statsinfo                                        |
| thumbnail                                        |
| thumbnailgenerationjob                           |
| transmittancerange                               |
| uploadjob                                        |
| uploadjob_versioninfo                            |
| well                                             |
| wellannotationlink                               |
| wellreagentlink                                  |
| wellsample                                       |

* All in columns in roi
:PROPERTIES:
:ID:       7ba37cb7-5374-4702-a8e4-9002f4af62ef
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
  select column_name from information_schema.columns where table_name='roi';
#+end_src

#+RESULTS:
| column_name |
|-------------|
| id          |
| description |
| permissions |
| name        |
| version     |
| creation_id |
| external_id |
| group_id    |
| owner_id    |
| update_id   |
| image       |
| source      |

* Image and ROI
:PROPERTIES:
:ID:       5c84a6e2-b418-4c21-b455-ee4a76475e60
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
  select image.id as image_id, roi.id as roi_id from image left join roi on roi.image = image.id;
#+end_src

#+RESULTS:
| image_id | roi_id |
|----------+--------|
|        5 |      1 |
|       10 |        |
|        2 |        |
|        8 |        |
|        6 |        |
|        4 |        |
|        1 |        |
|        3 |        |
|        9 |        |
|        7 |        |

* All in columns in image
:PROPERTIES:
:ID:       cd51a3b2-086b-44c8-a129-284dea4d5306
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
  select column_name from information_schema.columns where table_name='image';
#+end_src

#+RESULTS:
| column_name        |
|--------------------|
| id                 |
| acquisitiondate    |
| archived           |
| description        |
| permissions        |
| name               |
| partial            |
| series             |
| version            |
| creation_id        |
| external_id        |
| group_id           |
| owner_id           |
| update_id          |
| experiment         |
| fileset            |
| format             |
| imagingenvironment |
| instrument         |
| objectivesettings  |
| stagelabel         |

* Projects
:PROPERTIES:
:ID:       466e7663-27d9-48e6-b10c-4bcaa238d145
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 5432 :dbuser omero_db :dbpassword omero_db :database omero_database
  select * from project
  left join projectannotationlink on projectannotationlink.parent = project.id
#+end_src
#+RESULTS:
| id | description | permissions | name      | version | creation_id | external_id | group_id | owner_id | update_id | id | permissions | version | child | creation_id | external_id | group_id | owner_id | update_id | parent |
|----+-------------+-------------+-----------+---------+-------------+-------------+----------+----------+-----------+----+-------------+---------+-------+-------------+-------------+----------+----------+-----------+--------|
| 51 |             |          -8 | TFLM      |         |        5865 |             |       53 |       52 |      5865 |    |             |         |       |             |             |          |          |           |        |
|  1 |             |         -40 | project01 |         |        1162 |             |        3 |        2 |      1162 |    |             |         |       |             |             |          |          |           |        |

* Image
:PROPERTIES:
:ID:       71a91350-a2a8-4479-bfad-19325d02fd25
:END:
** All attributes
:PROPERTIES:
:ID:       7425289d-e78a-4b06-81eb-855f28abde0a
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
  select * from image; limit 10
#+end_src

#+RESULTS:
| id | acquisitiondate | archived | description | permissions | name                                       | partial | series | version | creation_id | external_id | group_id | owner_id | update_id | experiment | fileset | format | imagingenvironment | instrument | objectivesettings | stagelabel |
|----+-----------------+----------+-------------+-------------+--------------------------------------------+---------+--------+---------+-------------+-------------+----------+----------+-----------+------------+---------+--------+--------------------+------------+-------------------+------------|
|  1 |                 |          |             |        -120 | 2024-10-10_14-58-36_screenshot.png         |         |      0 |         |         311 |             |        0 |        0 |       311 |            |       1 |      4 |                    |            |                   |            |
|  2 |                 |          |             |        -120 | 2024-10-10_14-53-28_screenshot.png         |         |      0 |         |         339 |             |        0 |        0 |       339 |            |       2 |      4 |                    |            |                   |            |
|  3 |                 |          |             |        -120 | 2024-10-10_15-17-25_screenshot.png         |         |      0 |         |         367 |             |        0 |        0 |       367 |            |       3 |      4 |                    |            |                   |            |
|  4 |                 |          |             |        -120 | 2024-10-10_15-28-16_screenshot.png         |         |      0 |         |         395 |             |        0 |        0 |       395 |            |       4 |      4 |                    |            |                   |            |
|  5 |                 |          |             |        -120 | 2024-10-10_15-01-36_screenshot.png         |         |      0 |         |         423 |             |        0 |        0 |       423 |            |       5 |      4 |                    |            |                   |            |
|  6 |                 |          |             |        -120 | 2024-10-10_15-09-28_screenshot.png         |         |      0 |         |         451 |             |        0 |        0 |       451 |            |       6 |      4 |                    |            |                   |            |
|  7 |                 |          |             |        -120 | 2024-10-10_15-07-18_screenshot.png         |         |      0 |         |         479 |             |        0 |        0 |       479 |            |       7 |      4 |                    |            |                   |            |
|  8 |                 |          |             |        -120 | 2024-10-10_16-47-01_screenshot.png         |         |      0 |         |         507 |             |        0 |        0 |       507 |            |       8 |      4 |                    |            |                   |            |
|  9 |                 |          |             |        -120 | 2024-10-10_16-42-47_screenshot.png         |         |      0 |         |         535 |             |        0 |        0 |       535 |            |       9 |      4 |                    |            |                   |            |
| 10 |                 |          |             |        -120 | 2024-10-10_16-39-27_screenshot.png         |         |      0 |         |         563 |             |        0 |        0 |       563 |            |      10 |      4 |                    |            |                   |            |
| 11 |                 |          |             |        -120 | 2024-10-10_15-28-16_screenshot.png.ome.tif |         |      0 |         |         591 |             |        0 |        0 |       591 |            |      11 |    170 |                  1 |            |                   |            |
| 12 |                 |          |             |        -120 | image_6_with_roi.ome.tif                   |         |      0 |         |         619 |             |        0 |        0 |       619 |            |      12 |    170 |                  2 |            |                   |            |

** Image annotations
:PROPERTIES:
:ID:       9b14e702-bc4d-4e75-8ff1-5236c6fa3a2b
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
  select image.id, concat(annotation.ns, annotation_mapvalue.name) as key, annotation_mapvalue.value
  from image
  join imageannotationlink on image.id=imageannotationlink.parent
  join annotation on imageannotationlink.child = annotation.id
  join annotation_mapvalue on annotation.id = annotation_mapvalue.annotation_id
#+end_src

#+RESULTS:
|---|

* Folder
:PROPERTIES:
:ID:       62965f07-a737-4050-b2ee-6418baff21f3
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
  select * from folder;
#+end_src

#+RESULTS:
| id | description | permissions | name | version | creation_id | external_id | group_id | owner_id | update_id | parentfolder |
|----+-------------+-------------+------+---------+-------------+-------------+----------+----------+-----------+--------------|

* Folderannotationlink
:PROPERTIES:
:ID:       12bc20b2-9037-4f1b-9612-0fa8c36aaabc
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
  select * from folderannotationlink;
#+end_src

#+RESULTS:
| id | permissions | version | child | creation_id | external_id | group_id | owner_id | update_id | parent |
|----+-------------+---------+-------+-------------+-------------+----------+----------+-----------+--------|

* datasets in separate joins
:PROPERTIES:
:ID:       c254b55f-6517-4782-a09a-f38c937e5231
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
      select * from
                 (select dataset.id, datasetannotationlink.child as datasetannotationslink_annotation_id
                           from dataset join datasetannotationlink on dataset.id = datasetannotationlink.parent ) as dataset_datasetannotationlink
                 join (
                 (select dataset.id, datasetimagelink.child as datasetimagelink_image_id
                           from dataset join datasetimagelink on dataset.id = datasetimagelink.parent) as dataset_datasetimagelink
                           ) on dataset_datasetimagelink.dataset.id = dataset_datasetannotation.dataset.id
                        ;

#+end_src

#+RESULTS:
|---|

* Annotations
:PROPERTIES:
:ID:       c163c7b2-d0be-4894-bfb4-ebce24817c0e
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser postgres :dbpassword postgres :database postgres
      select * from annotation;
      #+end_src

      #+RESULTS:
      | discriminator    | id | description | permissions | name | ns                        | version | boolvalue | textvalue  | doublevalue | longvalue | termvalue | timevalue | creation_id | external_id | group_id | owner_id | update_id | file |
      |------------------+----+-------------+-------------+------+---------------------------+---------+-----------+------------+-------------+-----------+-----------+-----------+-------------+-------------+----------+----------+-----------+------|
      | /map/            | 20 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         691 |             |        0 |        0 |       695 |      |
      | /map/            |  1 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |          41 |             |        0 |        0 |        62 |      |
      | /basic/text/tag/ |  2 |             |        -120 |      |                           |         |           | TestTag    |             |           |           |           |          75 |             |        0 |        0 |        75 |      |
      | /map/            | 51 |             |        -120 |      |                           |       1 |           |            |             |           |           |           |        6945 |             |        0 |        0 |      6947 |      |
      | /map/            |  3 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         109 |             |        0 |        0 |       169 |      |
      | /map/            |  4 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         188 |             |        0 |        0 |       251 |      |
      | /map/            |  5 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         295 |             |        0 |        0 |       299 |      |
      | /basic/text/tag/ |  6 |             |        -120 |      |                           |         |           | Screenshot |             |           |           |           |         591 |             |        0 |        0 |       591 |      |
      | /map/            |  7 |             |        -120 |      | http://purl.org/dc/terms/ |         |           |            |             |           |           |           |         591 |             |        0 |        0 |       591 |      |
      | /basic/text/tag/ |  8 |             |        -120 |      |                           |         |           | Screenshot |             |           |           |           |         619 |             |        0 |        0 |       619 |      |
      | /map/            |  9 |             |        -120 |      | http://purl.org/dc/terms/ |         |           |            |             |           |           |           |         619 |             |        0 |        0 |       619 |      |
      | /basic/text/tag/ | 10 |             |        -120 |      |                           |         |           | Screenshot |             |           |           |           |         636 |             |        0 |        0 |       636 |      |
      | /map/            | 11 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         637 |             |        0 |        0 |       641 |      |
      | /map/            | 12 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         643 |             |        0 |        0 |       647 |      |
      | /map/            | 13 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         649 |             |        0 |        0 |       653 |      |
      | /map/            | 14 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         655 |             |        0 |        0 |       659 |      |
      | /map/            | 15 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         661 |             |        0 |        0 |       665 |      |
      | /map/            | 16 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         667 |             |        0 |        0 |       671 |      |
      | /map/            | 17 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         673 |             |        0 |        0 |       677 |      |
      | /map/            | 18 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         679 |             |        0 |        0 |       683 |      |
      | /map/            | 19 |             |        -120 |      | http://purl.org/dc/terms/ |       3 |           |            |             |           |           |           |         685 |             |        0 |        0 |       689 |      |

* namespace string check and set
:PROPERTIES:
:ID:       ed9d6bf8-7e22-4e3d-b168-f0002e86ac59
:END:

#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select regexp_replace(regexp_replace(
             case
               when _annotation.ns is null then 'http://www.openmicroscopy.org/ns/default/'
               else
               case
             when starts_with(_annotation.ns, 'http') then _annotation.ns
             when starts_with(_annotation.ns, '/') then regexp_replace(_annotation.ns, '^[\/]*', 'http://')
               else concat('http://', _annotation.ns)
              end
             end,
           '([^\/,#])$',
           '\1/'
  ), '\s', '_')
    as ns, _annotation.ns 
    from annotation as _annotation;
#+end_src

#+RESULTS:
| ns                                                         | ns                                                  |
|------------------------------------------------------------+-----------------------------------------------------|
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/                  |                                                     |
| http://www.openmicroscopy.org/ns/default/                  |                                                     |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/                  | www.openmicroscopy.org/ns/default                   |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://hms.harvard.edu/omero/forms/kvdata/MPB_Annotations/ | hms.harvard.edu/omero/forms/kvdata/MPB Annotations/ |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/                  |                                                     |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/                  |                                                     |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/                  |                                                     |
| http://MouseCT/Skyscan/System/                             | /MouseCT/Skyscan/System                             |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                                  | http://purl.org/dc/terms/                           |

* namespace regex replace
:PROPERTIES:
:ID:       ed9d6bf8-7e22-4e3d-b168-f0002e86ac59
:END:

#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select regexp_replace(regexp_replace(
             case
               when _annotation.ns is null then 'http://www.openmicroscopy.org/ns/default/'
               else
                case
                  when regexp_like(_annotation.ns, '^http[s]{0,1}:\/\/') then _annotation.ns
                  else 'http://www.openmicroscopy.org/ns/default/'
                end
             end,
           '([^\/,#])$',
           '\1/'
  ), '\s', '_')
    as ns, _annotation.ns 
    from annotation as _annotation;
#+end_src

#+RESULTS:
| ns                                        | ns                                                  |
|-------------------------------------------+-----------------------------------------------------|
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/ |                                                     |
| http://www.openmicroscopy.org/ns/default/ |                                                     |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/ | www.openmicroscopy.org/ns/default                   |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/ | hms.harvard.edu/omero/forms/kvdata/MPB Annotations/ |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/ |                                                     |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/ |                                                     |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://www.openmicroscopy.org/ns/default/ |                                                     |
| http://www.openmicroscopy.org/ns/default/ | /MouseCT/Skyscan/System                             |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |
| http://purl.org/dc/terms/                 | http://purl.org/dc/terms/                           |


* Experimenter and ExperimenterGroups
:PROPERTIES:
:ID:       1ee4a685-bff6-4acd-ad06-c96b32be98b5
:END:
** Experimenter
:PROPERTIES:
:ID:       e0f747e1-c4e7-4a35-b207-1147ce930b8b
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select * from experimenter ;
  limit 10
#+end_src

#+RESULTS:
| id | permissions | email | firstname | institution | lastname | ldap | middlename | omename | version | external_id |
|----+-------------+-------+-----------+-------------+----------+------+------------+---------+---------+-------------|
|  0 |           0 |       | root      |             | root     | f    |            | root    |       0 |             |
|  1 |           0 |       | Guest     |             | Account  | f    |            | guest   |       0 |             |

** Experiment
:PROPERTIES:
:ID:       104cf1b6-2322-410e-8089-f53fb6140138
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select * from experiment ;
  limit 10
#+end_src

#+RESULTS:
| id | description | permissions | version | creation_id | external_id | group_id | owner_id | update_id | type |
|----+-------------+-------------+---------+-------------+-------------+----------+----------+-----------+------|

** ExperimenterGrous
:PROPERTIES:
:ID:       104cf1b6-2322-410e-8089-f53fb6140138
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select * from experimentergroup ;
  limit 10
#+end_src

#+RESULTS:
| id | description | permissions | ldap | name   | version | external_id |
|----+-------------+-------------+------+--------+---------+-------------|
|  0 |             |        -120 | f    | system |       0 |             |
|  1 |             |         -52 | f    | user   |       0 |             |
|  2 |             |        -120 | f    | guest  |       0 |             |

* HCS
:PROPERTIES:
:ID:       dadc3b79-19e0-4b22-bd66-d981870fe444
:END:
** Screens
:PROPERTIES:
:ID:       df1a9716-ab75-4b52-8d72-8f1d513dd2f4
:END:

#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select * from WellSample
  limit 100
#+end_src

#+RESULTS:
|  id | permissions | posxunit        |           posx | posyunit        |             posy | timepoint | version | creation_id | external_id | group_id | owner_id | update_id | image | plateacquisition | well | well_index |
|-----+-------------+-----------------+----------------+-----------------+------------------+-----------+---------+-------------+-------------+----------+----------+-----------+-------+------------------+------+------------|
|   1 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   245 |                1 |    1 |          0 |
|   2 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   246 |                1 |    1 |          1 |
|   3 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   247 |                1 |    1 |          2 |
|   4 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   248 |                1 |    1 |          3 |
|   5 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   249 |                1 |    2 |          0 |
|   6 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   250 |                1 |    2 |          1 |
|   7 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   251 |                1 |    2 |          2 |
|   8 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   252 |                1 |    2 |          3 |
|   9 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   253 |                1 |    3 |          0 |
|  10 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   254 |                1 |    3 |          1 |
|  11 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   255 |                1 |    3 |          2 |
|  12 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   256 |                1 |    3 |          3 |
|  13 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   257 |                1 |    4 |          0 |
|  14 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   258 |                1 |    4 |          1 |
|  15 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   259 |                1 |    4 |          2 |
|  16 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   260 |                1 |    4 |          3 |
|  17 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   261 |                1 |    5 |          0 |
|  18 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   262 |                1 |    5 |          1 |
|  19 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   263 |                1 |    5 |          2 |
|  20 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   264 |                1 |    5 |          3 |
|  21 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   265 |                1 |    6 |          0 |
|  22 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   266 |                1 |    6 |          1 |
|  23 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   267 |                1 |    6 |          2 |
|  24 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   268 |                1 |    6 |          3 |
|  25 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   269 |                1 |    7 |          0 |
|  26 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   270 |                1 |    7 |          1 |
|  27 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   271 |                1 |    7 |          2 |
|  28 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   272 |                1 |    7 |          3 |
|  29 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   273 |                1 |    8 |          0 |
|  30 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   274 |                1 |    8 |          1 |
|  31 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   275 |                1 |    8 |          2 |
|  32 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   276 |                1 |    8 |          3 |
|  33 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   277 |                1 |    9 |          0 |
|  34 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   278 |                1 |    9 |          1 |
|  35 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   279 |                1 |    9 |          2 |
|  36 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   280 |                1 |    9 |          3 |
|  37 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   281 |                1 |   10 |          0 |
|  38 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   282 |                1 |   10 |          1 |
|  39 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   283 |                1 |   10 |          2 |
|  40 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   284 |                1 |   10 |          3 |
|  41 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   285 |                1 |   11 |          0 |
|  42 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   286 |                1 |   11 |          1 |
|  43 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   287 |                1 |   11 |          2 |
|  44 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   288 |                1 |   11 |          3 |
|  45 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   289 |                1 |   12 |          0 |
|  46 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   290 |                1 |   12 |          1 |
|  47 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   291 |                1 |   12 |          2 |
|  48 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   292 |                1 |   12 |          3 |
|  49 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   293 |                1 |   13 |          0 |
|  50 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   294 |                1 |   13 |          1 |
|  51 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   295 |                1 |   13 |          2 |
|  52 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   296 |                1 |   13 |          3 |
|  53 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   297 |                1 |   14 |          0 |
|  54 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   298 |                1 |   14 |          1 |
|  55 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   299 |                1 |   14 |          2 |
|  56 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   300 |                1 |   14 |          3 |
|  57 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   301 |                1 |   15 |          0 |
|  58 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   302 |                1 |   15 |          1 |
|  59 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   303 |                1 |   15 |          2 |
|  60 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   304 |                1 |   15 |          3 |
|  61 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   305 |                1 |   16 |          0 |
|  62 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   306 |                1 |   16 |          1 |
|  63 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   307 |                1 |   16 |          2 |
|  64 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   308 |                1 |   16 |          3 |
|  65 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   309 |                1 |   17 |          0 |
|  66 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   310 |                1 |   17 |          1 |
|  67 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   311 |                1 |   17 |          2 |
|  68 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   312 |                1 |   17 |          3 |
|  69 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   313 |                1 |   18 |          0 |
|  70 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   314 |                1 |   18 |          1 |
|  71 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   315 |                1 |   18 |          2 |
|  72 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   316 |                1 |   18 |          3 |
|  73 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   317 |                1 |   19 |          0 |
|  74 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   318 |                1 |   19 |          1 |
|  75 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   319 |                1 |   19 |          2 |
|  76 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   320 |                1 |   19 |          3 |
|  77 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   321 |                1 |   20 |          0 |
|  78 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   322 |                1 |   20 |          1 |
|  79 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   323 |                1 |   20 |          2 |
|  80 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   324 |                1 |   20 |          3 |
|  81 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   325 |                1 |   21 |          0 |
|  82 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   326 |                1 |   21 |          1 |
|  83 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   327 |                1 |   21 |          2 |
|  84 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   328 |                1 |   21 |          3 |
|  85 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   329 |                1 |   22 |          0 |
|  86 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   330 |                1 |   22 |          1 |
|  87 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   331 |                1 |   22 |          2 |
|  88 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   332 |                1 |   22 |          3 |
|  89 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   333 |                1 |   23 |          0 |
|  90 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   334 |                1 |   23 |          1 |
|  91 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   335 |                1 |   23 |          2 |
|  92 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   336 |                1 |   23 |          3 |
|  93 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   337 |                1 |   24 |          0 |
|  94 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   338 |                1 |   24 |          1 |
|  95 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   339 |                1 |   24 |          2 |
|  96 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   340 |                1 |   24 |          3 |
|  97 |        -120 | reference frame | -757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   341 |                1 |   25 |          0 |
|  98 |        -120 | reference frame |  757.759765625 | reference frame | -757.76025390625 |           |         |       11414 |             |        0 |        0 |     11414 |   342 |                1 |   25 |          1 |
|  99 |        -120 | reference frame | -757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   343 |                1 |   25 |          2 |
| 100 |        -120 | reference frame |  757.759765625 | reference frame |    757.759765625 |           |         |       11414 |             |        0 |        0 |     11414 |   344 |                1 |   25 |          3 |

* Channel
:PROPERTIES:
:ID:       f24c3f74-96ea-426d-9fac-29a94d1e92be
:END:

#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select * from channel
  limit 1
#+end_src

#+RESULTS:
|  id | alpha | blue | permissions | green | lookuptable | red | version | creation_id | external_id | group_id | owner_id | update_id | logicalchannel | pixels | statsinfo | pixels_index |
|-----+-------+------+-------------+-------+-------------+-----+---------+-------------+-------------+----------+----------+-----------+----------------+--------+-----------+--------------|
| 244 |   255 |  255 |        -120 |     0 |             |   0 |         |       11414 |             |        0 |        0 |     11414 |            244 |    244 |       231 |            0 |

#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select * from pixels
  limit 20
#+end_src

#+RESULTS:
|  id | permissions | methodology | physicalsizexunit |      physicalsizex | physicalsizeyunit |      physicalsizey | physicalsizezunit | physicalsizez | sha1                                     | significantbits | sizec | sizet | sizex | sizey | sizez | timeincrementunit | timeincrement | version | waveincrement | wavestart | creation_id | external_id | group_id | owner_id | update_id | dimensionorder | image | pixelstype | relatedto | image_index | path                           | name                                       | repo                                 |
|-----+-------------+-------------+-------------------+--------------------+-------------------+--------------------+-------------------+---------------+------------------------------------------+-----------------+-------+-------+-------+-------+-------+-------------------+---------------+---------+---------------+-----------+-------------+-------------+----------+----------+-----------+----------------+-------+------------+-----------+-------------+--------------------------------+--------------------------------------------+--------------------------------------|
|  10 |        -120 |             |                   |                    |                   |                    |                   |               | 6222079fe42deb42edbc1d6df3099c4419102398 |               8 |     3 |     1 |   695 |   597 |     1 |                   |               |         |               |           |         563 |             |        0 |        0 |       566 |              1 |    10 |          5 |           |           0 | root_0/2024-12/21/17-08-11.191 | 2024-10-10_16-39-27_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|   1 |        -120 |             |                   |                    |                   |                    |                   |               | e912cd2a7293678793071a275ce324431d1b7762 |               8 |     3 |     1 |   622 |   371 |     1 |                   |               |         |               |           |         311 |             |        0 |        0 |       314 |              1 |     1 |          5 |           |           0 | root_0/2024-12/21/17-07-39.945 | 2024-10-10_14-58-36_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|   7 |        -120 |             |                   |                    |                   |                    |                   |               | 40873302865298a47fd08cd62335133a4475bf81 |               8 |     3 |     1 |   706 |   276 |     1 |                   |               |         |               |           |         479 |             |        0 |        0 |       482 |              1 |     7 |          5 |           |           0 | root_0/2024-12/21/17-07-57.980 | 2024-10-10_15-07-18_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|   2 |        -120 |             |                   |                    |                   |                    |                   |               | 3a17a2fa02de4e61ecc999a2bbeea9bc49ff881d |               8 |     3 |     1 |   473 |   215 |     1 |                   |               |         |               |           |         339 |             |        0 |        0 |       342 |              1 |     2 |          5 |           |           0 | root_0/2024-12/21/17-07-43.764 | 2024-10-10_14-53-28_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|   3 |        -120 |             |                   |                    |                   |                    |                   |               | 6603d64324e4ca8d2af86b15f4cf1fd3171291a2 |               8 |     3 |     1 |   445 |   299 |     1 |                   |               |         |               |           |         367 |             |        0 |        0 |       370 |              1 |     3 |          5 |           |           0 | root_0/2024-12/21/17-07-46.736 | 2024-10-10_15-17-25_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|   8 |        -120 |             |                   |                    |                   |                    |                   |               | 0e9017b73a0207752b9d006a6533712e19ed799d |               8 |     4 |     1 |   700 |   604 |     1 |                   |               |         |               |           |         507 |             |        0 |        0 |       510 |              1 |     8 |          5 |           |           0 | root_0/2024-12/21/17-08-00.851 | 2024-10-10_16-47-01_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|   4 |        -120 |             |                   |                    |                   |                    |                   |               | edab40516e94bf7729317cafa6a626b6a6bdef6a |               8 |     3 |     1 |   696 |   756 |     1 |                   |               |         |               |           |         395 |             |        0 |        0 |       398 |              1 |     4 |          5 |           |           0 | root_0/2024-12/21/17-07-49.530 | 2024-10-10_15-28-16_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|  11 |        -120 |             |                   |                    |                   |                    |                   |               | 76c870ba3983cea65a43baba7de2470840fb37e3 |               8 |     3 |     1 |   696 |   756 |     1 |                   |               |         |               |           |         591 |             |        0 |        0 |       594 |              1 |    11 |          5 |           |           0 | root_0/2024-12/21/17-08-13.731 | 2024-10-10_15-28-16_screenshot.png.ome.tif | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|   5 |        -120 |             |                   |                    |                   |                    |                   |               | 893f5a25aa97fc15a63a4ec480757636dc9d91a0 |               8 |     3 |     1 |   364 |   346 |     1 |                   |               |         |               |           |         423 |             |        0 |        0 |       426 |              1 |     5 |          5 |           |           0 | root_0/2024-12/21/17-07-52.453 | 2024-10-10_15-01-36_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|   6 |        -120 |             |                   |                    |                   |                    |                   |               | f3b99b63d08e1aac1905d154933d8f81ca891c99 |               8 |     3 |     1 |    71 |    22 |     1 |                   |               |         |               |           |         451 |             |        0 |        0 |       454 |              1 |     6 |          5 |           |           0 | root_0/2024-12/21/17-07-55.276 | 2024-10-10_15-09-28_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|   9 |        -120 |             |                   |                    |                   |                    |                   |               | 0c4549945070ad38ed8247f02bf7c1b1ee7e7152 |               8 |     3 |     1 |   697 |   604 |     1 |                   |               |         |               |           |         535 |             |        0 |        0 |       538 |              1 |     9 |          5 |           |           0 | root_0/2024-12/21/17-08-08.708 | 2024-10-10_16-42-47_screenshot.png         | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
|  12 |        -120 |             |                   |                    |                   |                    |                   |               | 4c014aaf3621eb19653ee89bc5df8dac334ae1aa |               8 |     3 |     1 |   706 |   276 |     1 |                   |               |         |               |           |         619 |             |        0 |        0 |       622 |              1 |    12 |          5 |           |           0 | root_0/2024-12/21/17-08-16.466 | image_6_with_roi.ome.tif                   | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
| 244 |        -120 |             | m                | 0.7400001049041748 | m                | 0.7400001049041748 |                   |               | cdf2ed09a99467dce1fdc68fa1dd067111074287 |              16 |     2 |     1 |  2048 |  2048 |     1 |                   |               |         |               |           |       11414 |             |        0 |        0 |     14604 |              1 |   244 |          6 |           |           0 | root_0/2025-02/13/11-28-21.117 | 2011-11-17 X-Man LOPAC_X03_LP_S01_1.xdce   | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
| 789 |        -120 |             | m                | 0.7400001049041748 | m                | 0.7400001049041748 |                   |               | 6eea4b837163791320e53838e375a1a1dcbc7f1c |              16 |     2 |     1 |  2048 |  2048 |     1 |                   |               |         |               |           |       11414 |             |        0 |        0 |     14604 |              1 |   789 |          6 |           |           0 | root_0/2025-02/13/11-28-21.117 | 2011-11-17 X-Man LOPAC_X03_LP_S01_1.xdce   | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
| 790 |        -120 |             | m                | 0.7400001049041748 | m                | 0.7400001049041748 |                   |               | 6eea4b837163791320e53838e375a1a1dcbc7f1c |              16 |     2 |     1 |  2048 |  2048 |     1 |                   |               |         |               |           |       11414 |             |        0 |        0 |     14604 |              1 |   790 |          6 |           |           0 | root_0/2025-02/13/11-28-21.117 | 2011-11-17 X-Man LOPAC_X03_LP_S01_1.xdce   | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
| 791 |        -120 |             | m                | 0.7400001049041748 | m                | 0.7400001049041748 |                   |               | 6eea4b837163791320e53838e375a1a1dcbc7f1c |              16 |     2 |     1 |  2048 |  2048 |     1 |                   |               |         |               |           |       11414 |             |        0 |        0 |     14604 |              1 |   791 |          6 |           |           0 | root_0/2025-02/13/11-28-21.117 | 2011-11-17 X-Man LOPAC_X03_LP_S01_1.xdce   | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
| 792 |        -120 |             | m                | 0.7400001049041748 | m                | 0.7400001049041748 |                   |               | 6eea4b837163791320e53838e375a1a1dcbc7f1c |              16 |     2 |     1 |  2048 |  2048 |     1 |                   |               |         |               |           |       11414 |             |        0 |        0 |     14604 |              1 |   792 |          6 |           |           0 | root_0/2025-02/13/11-28-21.117 | 2011-11-17 X-Man LOPAC_X03_LP_S01_1.xdce   | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
| 753 |        -120 |             | m                | 0.7400001049041748 | m                | 0.7400001049041748 |                   |               | 6eea4b837163791320e53838e375a1a1dcbc7f1c |              16 |     2 |     1 |  2048 |  2048 |     1 |                   |               |         |               |           |       11414 |             |        0 |        0 |     14604 |              1 |   753 |          6 |           |           0 | root_0/2025-02/13/11-28-21.117 | 2011-11-17 X-Man LOPAC_X03_LP_S01_1.xdce   | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
| 754 |        -120 |             | m                | 0.7400001049041748 | m                | 0.7400001049041748 |                   |               | 6eea4b837163791320e53838e375a1a1dcbc7f1c |              16 |     2 |     1 |  2048 |  2048 |     1 |                   |               |         |               |           |       11414 |             |        0 |        0 |     14604 |              1 |   754 |          6 |           |           0 | root_0/2025-02/13/11-28-21.117 | 2011-11-17 X-Man LOPAC_X03_LP_S01_1.xdce   | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
| 755 |        -120 |             | m                | 0.7400001049041748 | m                | 0.7400001049041748 |                   |               | 6eea4b837163791320e53838e375a1a1dcbc7f1c |              16 |     2 |     1 |  2048 |  2048 |     1 |                   |               |         |               |           |       11414 |             |        0 |        0 |     14604 |              1 |   755 |          6 |           |           0 | root_0/2025-02/13/11-28-21.117 | 2011-11-17 X-Man LOPAC_X03_LP_S01_1.xdce   | 34a716b6-d4f9-4cea-861b-4229819e82d8 |
* PixelsDimensionsOrder
:PROPERTIES:
:ID:       c896882f-d257-4234-8191-1c7a84ad780d
:END:

#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select * from pixelsdimensionsorder ;
  limit 10
#+end_src

#+RESULTS:
|---|
event                                            
eventlog                                        
eventtype                                      |
* Events
:PROPERTIES:
:ID:       f534f360-c0b3-4da3-a19b-9cbe6ef6f343
:END:
#+begin_src  sql :engine postgres :dbhost localhost :dbport 15432 :dbuser ontop :dbpassword !ontop$ :database postgres
  select * from eventlog ;
#+end_src

#+RESULTS:
| id | permissions | value      | external_id |
|----+-------------+------------+-------------|
|  0 |         -52 | Bootstrap  |             |
|  1 |         -52 | Import     |             |
|  2 |         -52 | Internal   |             |
|  3 |         -52 | Shoola     |             |
|  4 |         -52 | User       |             |
|  5 |         -52 | Task       |             |
|  6 |         -52 | Test       |             |
|  7 |         -52 | Processing |             |
|  8 |         -52 | FullText   |             |
|  9 |         -52 | Sessions   |             |
